"Volume" = "Volumen"; 
"Drawbars" = "Barras armónicos"; 
"Percussion Level" = "Nivel percusión"; 
"Percussion Time" = "Tiempo percusión"; 
"Click" = "Clic"; 
"Distortion" = "Distorsión"; 
"Rotary Speaker" = "Altavoz rotatorio"; 


